#include "stdafx.h"
#include "loading.h"
#include "LoadingScene.h"

HRESULT LoadingScene::Init(void)
{
	_loading = new loading;
	_loading->init();

	this->LoadingSound();
	this->LoadingImage();

	return S_OK;
}

void LoadingScene::Release(void)
{
	//_loading->release();
	//SAFE_DELETE(_loading);
}

void LoadingScene::Update(void)
{
	_loading->update();
	if (_loading->loadingDone())
	{
		SCENEMANAGER->ChangeScene("시작화면");
	}
}

void LoadingScene::Render(void)
{
	_loading->render();
}


void LoadingScene::LoadingImage()
{
	// ===============================================================================================
	// ################# 지상 스테이지 이미지 ###########################################################
	// ===============================================================================================




	// ===============================================================================================
	// ###############################################################################################
	// ===============================================================================================




	// ===============================================================================================
	// ################# 지하 스테이지 이미지 ###########################################################
	// ===============================================================================================

	_loading->loadImage("지하배경", "BackGround/지하베이스.bmp", 6774, 958);
	_loading->loadImage("지하배경픽셀", "BackGround/지하베이스픽셀.bmp", 6774, 958);
	_loading->loadFrameImage("통나옴", "BackGround/통나옴.bmp", 7392, 384, 22, 1, true, RGB(255, 0, 255));

	//IMAGEMANAGER->addImage("지하배경", "BackGround/지하베이스.bmp", 6774, 958);
	//IMAGEMANAGER->addImage("지하배경픽셀", "BackGround/지하베이스픽셀.bmp", 6774, 958);
	//IMAGEMANAGER->addFrameImage("통나옴", "BackGround/통나옴.bmp", 7392, 384, 22, 1, true, RGB(255, 0, 255));
	// ===============================================================================================
	// ###############################################################################################
	// ===============================================================================================


	// ===============================================================================================
	// ################# 보스전 이미지 #################################################################
	// ===============================================================================================

	_loading->loadImage("보스배경", "BackGround/보스배경.bmp", 2555, 958);
	_loading->loadFrameImage("보스출렁", "BackGround/보스출렁.bmp", 10240, 100, 8, 1);
	_loading->loadImage("곧부서짐", "BackGround/곧부서짐.bmp", 875, 183);


	//IMAGEMANAGER->addImage("보스배경", "BackGround/보스배경.bmp", 2555, 958);
	//IMAGEMANAGER->addFrameImage("보스출렁", "BackGround/보스출렁.bmp", 10240, 100, 8, 1);
	// ===============================================================================================
	// ###############################################################################################
	// ===============================================================================================

}

void LoadingScene::LoadingSound()
{

	// ===============================================================================================
	// ################################### 포로 사운드 삽입 ############################################
	// ===============================================================================================

	_loading->loadSound("포로떙큐", "SOUND/포로/포로땡큐.mp3", false, false);		// 포로 감사
	_loading->loadSound("포로충성", "SOUND/포로/포로감사.mp3", false, false);		// 포로 충성
	_loading->loadSound("가방포로", "SOUND/포로/가방포로.mp3", false, false);		// 가방포로(유미) 감사

	// ===============================================================================================
	// ################################### 선택 사운드 삽입 ############################################
	// ===============================================================================================
	
	_loading->loadSound("선택문열림", "SOUND/캐릭터선택/선택문열림.mp3", false, false);
	_loading->loadSound("선택문닫힘", "SOUND/캐릭터선택/선택문닫힘.mp3", false, false);
	_loading->loadSound("타마선택", "SOUND/캐릭터선택/타마선택.mp3", false, false);

	// ===============================================================================================
	// ################################### effect 사운드 삽입 ##########################################
	// ===============================================================================================

	_loading->loadSound("동전넣기", "SOUND/이펙트/동전넣기.mp3", false, false);
	_loading->loadSound("딱총", "SOUND/이펙트/딱총.mp3", false, false);
	_loading->loadSound("미션1시작", "SOUND/이펙트/미션1시작.mp3", false, false);
	_loading->loadSound("미션클리어", "SOUND/이펙트/미션클리어.mp3", false, false);
	_loading->loadSound("아이템먹음", "SOUND/이펙트/아이템먹음.mp3", false, false);
	_loading->loadSound("죽음", "SOUND/이펙트/죽음.mp3", false, false);
	//_loading->loadSound("칼질", "SOUND/이펙트/칼질.mp3", false, false);
	//_loading->loadSound("칼질2", "SOUND/이펙트/칼질2.mp3", false, false);
	_loading->loadSound("헤비먹음", "SOUND/이펙트/헤비먹음.mp3", false, false);
	_loading->loadSound("헤비발사", "SOUND/이펙트/헤비발사.mp3", false, false);
	_loading->loadSound("장벽부서짐", "SOUND/이펙트/장벽부서짐.mp3", false, false);

	// ===============================================================================================
	// ################################### 몬스터 사운드 삽입 ###########################################
	// ===============================================================================================

	_loading->loadSound("거품공격", "SOUND/몬스터/거품공격.mp3", false, false);
	_loading->loadSound("몬스터총맞음", "SOUND/몬스터/몬스터총맞음.mp3", false, false);
	_loading->loadSound("물고기죽음", "SOUND/몬스터/물고기죽음.mp3", false, false);
	_loading->loadSound("보스게부숨", "SOUND/몬스터/보스게부숨.mp3", false, false);
	_loading->loadSound("보스게죽음", "SOUND/몬스터/보스게죽음.mp3", false, false);
	_loading->loadSound("보스페이즈2", "SOUND/몬스터/보스페이즈2.mp3", false, false);
	_loading->loadSound("작은게죽음", "SOUND/몬스터/작은게죽음.mp3", false, false);
	_loading->loadSound("잠자리죽음", "SOUND/몬스터/잠자리죽음.mp3", false, false);
	_loading->loadSound("큰게죽음", "SOUND/몬스터/큰게죽음.mp3", false, false);

	// ===============================================================================================
	// #################################### BGM 사운드 삽입 ###########################################
	// ===============================================================================================

	_loading->loadSound("보스전시작", "SOUND/브금/보스전시작.mp3", true, true);
	_loading->loadSound("선택", "SOUND/브금/선택.mp3", true, true);
	_loading->loadSound("선택전", "SOUND/브금/선택전.mp3", true, true);
	_loading->loadSound("스테이지시작", "SOUND/브금/스테이지시작.mp3", true, true);
	_loading->loadSound("지하시작", "SOUND/브금/지하시작.mp3", true, true);
	
}
